[
  {
    "photoUrl": "https://images.unsplash.com/photo-1687425973269-af0d62587769?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "id": 1,
    "isFavorite": false,
    "healthyIngredients": [
      "500 gr dada ayam",
      "1 sdm bawang merah goreng",
      "1 sdt garlic powder",
      "1/2 sdt baking powder",
      "5 gr himalayan salt",
      "2 butir putih telur",
      "120 gr es batu"
    ],
    "description": "Bakso adalah masakan indonesia yang terbuat dari campuran daging giling (seperti daging sapi, ayam, atau ikan) dan tepung tapioka atau tepung kanji lainnya. Campuran bakso tersebut dibumbui dengan berbagai macam bumbu, antara lain bawang putih, bawang merah, garam, dan merica. Tekstur bakso biasanya padat dan kenyal.",
    "healthySteps": [
      "1). Haluskan daging ayam di dalam food processor, lalu tambahkan es batu separo. Masukkan semua bumbu kecuali putih telur. ",
      "2). Setelah tercampur rata, masukkan putih telur dan sisa es batu. Setelah bahan tercampur rata, simpan adonan di dalam freezer 15 menit hingga adonan dingin.",
      "3). Sambil menunggu adonan dingin, buat kuahnya, didihkan air lalu masukkan semua bumbu.",
      "4). Panaskan air tidak usah sampai mendidih, lalu matikan. Ambil dan bentuk adonan bakso. Langsung masukkan ke air panas tadi, sampai adonan habis. Setelah itu nyalakan kompor, rebus hingga bakso mengapung.",
      "5). Masukkan bakso ke dalam kuah, tambahkan topping sesuai selera."
    ],
    "ingredients": [
      "500 gram daging sapi",
      "1 butir telur",
      "100 gram tepung kanji",
      "3 siung bawang putih yang sudah dihaluskan",
      "1 sdt lada bubuk",
      "1/2 sdt bubuk pala",
      "1 sdm garam",
      "1/2 sdt kaldu sapi bubuk",
      "Air secukupnya untuk merebus"
    ],
    "steps": [
      "1). Giling 500 gram daging sapi yang sudah dibersihkan. Jika sudah halus, masukkan telur dan bumbu lainnya kecuali tepung kanji. Untuk mempermudah dan menghemat waktu, kita bisa gunakan alat masak food processor.",
      "2). Selanjutnya, tuang tepung kanji sedikit demi sedikit sambil terus diaduk.",
      "3). Setelah adonan bakso siap, masak air sampai mendidih. Kemudian bulat-bulatkan adonan sesuai selera dan masukkan ke dalam air yang mendidih.",
      "4). Biarkan hingga terapung, angkat, dan tiriskan.",
      "5). Bakso sudah siap untuk diolah menjadi hidangan lezat."
    ],
    "slug": "bakso",
    "title": "Bakso",
    "search_record": 2,
    "calories": 750,
    "healthyCalories": 500
  },
  {
    "photoUrl": "https://cdn0-production-images-kly.akamaized.net/SWZgYD08PrVebjX4xQsiXT4UtY8=/680x383/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4191578/original/036046400_1665728924-shutterstock_1920332333.jpg",
    "healthyIngredients": [
      "4 butir telur",
      "1 tomat",
      "5 cabe keriting",
      "2 siung bawang putih",
      "2 siung bawang merah",
      "Garam (secukupnya)"
    ],
    "healthySteps": [
      "1). Rebus telur sampai matang.",
      "2). Uleg semua bahan.",
      "3). Tumis bumbu yang sudah diuleg/dihaluskan. Lalu masukkan telur yang sudah direbus tadi.",
      "4). Jika sudah angkat dan sajikan."
    ],
    "description": "Telur balado merupakan salah satu makanan khas dari Minangkabau yang dimasak dengan cara menumis cabai bersama telur hingga meresap. Rasa sambal balado yang meresap bakal membuat telur lebih nikmat.",
    "ingredients": [
      "6 butir telur rebus",
      "5 butir bawang merah",
      "3 siung bawang putih",
      "3 cabai merah keriting",
      "2 buah tomat ukuran besar",
      "1/2 sdm garam",
      "1 sdt kaldu bubuk (opsional)",
      "1 sdm gula pasir",
      "Minyak goreng secukupnya untuk menumis"
    ],
    "id": 10,
    "steps": [
      "1). Goreng telur rebus (ini sesuai selera, jika tak suka digoreng bisa dimasak langsung).",
      "2). Blender semua bahan bumbu halus kecuali garam, gula, dan kaldu bubuk.",
      "3). Tumis bumbu halus dan masukkan garam, gula, dan penyedap rasa.",
      "4). Masak sampai harum.",
      "5). Masukkan telur rebus dan tumis sampai matang dan bumbu meresap. Angkat."
    ],
    "isFavorite": false,
    "search_record": 0,
    "slug": "telur balado",
    "title": "Telur Balado",
    "healthyCalories": 280,
    "calories": 300
  },
  {
    "healthyIngredients": [
      "1 papan Tempe Panjang",
      "7 siung Bawang Merah",
      "4 siung Bawang Putih",
      "1,5 sdt Ketumbar",
      "Kecap Secukupnya",
      "2 sampai 2,5 Gula Aren iris tipis tipis",
      "1 sachet kecil Asam Jawa",
      "Garam Secukupnya",
      "Kaldu Jamur Totole Secukupnya",
      "Air Secukupnya"
    ],
    "healthySteps": [
      "1). Potong Tempe 1,5cm. Kemudian disayat sayat biar bumbu meresap.",
      "2). Uleg halus bawang merah, bawang putih, ketumbar. Tumis sebentar dalam rice cooker (tanpa minyak).",
      "3). Setelah bumbu halus tumis bumbu di rice cooker (tanpa minyak) sampai cukup harum. Tuang air secukupnya. Jika suka kuah bacem bisa tambahkan air 500-600ml. Jika ingin bacem kering tuang air 300ml saja. Masukkan Gula Aren, Garam, Kecap, dan Kaldu Jamur. Sesuaikan Rasa.",
      "4). Setelah mendidih masukkan tempe. Masak sampai matang. Tempe bacem ini bisa dihangatkan selama 2 hari dan rasanya semakin enak karena bumbu lebih meresap."
    ],
    "healthyCalories": 40,
    "description": "Tempe bacem adalah salah satu makanan tradisional Jawa Tengah yang terbuat dari tempe yang digoreng dan dibumbui dengan berbagai bumbu seperti kencur, cabai, ketumbar, dan gula merah. Makanan ini juga sangat nikmat dan mudah dibuat di rumah. Sejarah tempe bacem berasal dari daerah Puro Pakualaman di Jawa Tengah.",
    "ingredients": [
      "8 buah tempe",
      "Air secukupnya untuk direbus",
      "8 butir bawang merah",
      "5 buah bawang putih",
      "1 sdm ketumbar",
      "2 butir asam jawa",
      "1 ruas lengkuas",
      "5 lembar daun salam",
      "1 keping gula merah/sesuai selera",
      "5 sdm kecap manis",
      "Garam secukupnya"
    ],
    "id": 11,
    "calories": 49,
    "steps": [
      "1). Goreng tempe dulu agar tidak mudah hancur sewaktu direbus. Goreng sebentar saja dan jangan terlalu kering. Angkat dan tiriskan.",
      "2). Ungkep tempe dengan semua bumbu kecuali kecap. Pastikan seluruh bahan terendam air.",
      "3). Masak dengan api sedang hingga mendidih, lalu koreksi rasa. Tambahkan kecap manis, bolak-balik tahu tempe agar bumbu meresap. Kecilkan api, masak hingga air habis.",
      "4). Diamkan dahulu beberapa saat sampai dingin sebelum digoreng/disajikan.",
      "5). Goreng tempe dan tempe bacem siap dimakan."
    ],
    "isFavorite": false,
    "search_record": 0,
    "title": "Tempe Bacem",
    "slug": "tempe bacem",
    "photoUrl": "https://img-global.cpcdn.com/recipes/04b100f878c7dc02/1200x630cq70/photo.jpg"
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-and-halloumi-baguette-addaf63.jpg?quality=90&webp=true&resize=375,341",
    "healthyIngredients": [
      "1 buah alpukat besar",
      "1 jeruk nipis, diambil jusnya",
      "1/2 bawang merah, dipotong tipis",
      "Semprotan minyak untuk menggoreng",
      "150g chorizo rendah lemak, dipotong miring",
      "250g keju halloumi rendah lemak, dipotong menjadi 8 potong",
      "1 batang roti gandum utuh atau roti gandum utuh 2 kecil",
      "Sejumput daun ketumbar, daun peterseli, atau daun selada",
      "400g kaleng tomat cincang",
      "1 cabai merah besar, diiris halus",
      "1 potong jahe seukuran ibu jari, diparut",
      "1 batang seledri, dipotong dadu",
      "250g gula rendah kalori",
      "150ml cuka sari apel"
    ],
    "healthySteps": [
      "1). Untuk membuat selai tomat rendah kalori, masukkan kaleng tomat cincang, cabai merah, jahe parut, bintang anyi, pengganti gula rendah kalori, dan cuka sari apel ke dalam panci. Bumbui dengan sedikit garam dan merica sesuai selera. Masak dengan api kecil selama sekitar 30 menit atau hingga mendapatkan selai yang kental. Dinginkan, lalu simpan dalam wadah steril jika ingin disimpan lebih dari dua minggu. Selai tomat ini dapat bertahan selama enam bulan jika belum dibuka.",
      "2). Bagi alpukat menjadi dua, buang bijinya, dan ambil dagingnya dengan sendok. Letakkan daging alpukat dalam mangkuk. Tambahkan jus setengah jeruk nipis dan sedikit garam. Hancurkan alpukat dengan garpu hingga halus.",
      "3). Letakkan bawang merah dalam mangkuk kecil, tuangkan sisa jus jeruk nipis, dan beri sedikit garam. Aduk rata dan biarkan sebentar untuk diacarkan.",
      "4). Panaskan sedikit minyak dalam wajan besar atau panaskan penggorengan udara hingga suhu 200°C selama 4 menit. Jika menggunakan penggorengan udara, atur irisan chorizo dan halloumi dalam satu lapisan di sisi berlawanan dari keranjang. Jika tidak cukup ruang, masak secara terpisah dalam beberapa tahap. Panggang dengan penggorengan udara selama 8-10 menit hingga halloumi berwarna keemasan dan chorizo kecokelatan.",
      "5). Belah roti secara horizontal dan hangatkan dalam penggorengan udara atau oven selama 1-2 menit. Oleskan alpukat di satu sisi roti dan selai tomat di sisi lainnya. Isi roti dengan halloumi, chorizo, daun ketumbar, dan bawang merah yang telah diacarkan. Potong dan sajikan."
    ],
    "healthyCalories": 2479,
    "description": "Baguette Chorizo & Halloumi adalah hidangan yang menggabungkan cita rasa yang kaya dan beragam dalam sepotong roti baguette yang renyah. Hidangan ini terdiri dari irisan chorizo pedas yang gurih dan potongan halloumi yang lezat, dua bahan utama yang memberikan kelezatan dan keunikan pada hidangan ini.",
    "ingredients": [
      "1 Buah Alpukat",
      "1 Buah Jeruk Nipis, ambil airnya",
      "1/2 bawang merah, dipotong tipis",
      "Sedikit minyak goreng",
      "150g Chorizo",
      "250g Keju halloumi",
      "1 batang roti baguette",
      "Sejumput daun ketumbar",
      "400g Tomat cincang",
      "1 Buah cabai merah",
      "1 potong jahe seukuran ibu jari",
      "1 batang selederi",
      "250gr gula pasir",
      "150ml cuka anggur merah"
    ],
    "id": 12,
    "calories": 3500,
    "title": "Baguette Chorizo & Halloumi",
    "steps": [
      "1). Untuk membuat selai tomat, masukkan semua bahan ke dalam panci, bumbui dan biarkan mendidih selama 30 menit hingga Anda mendapatkan selai yang kaya dan kental.",
      "2). Dinginkan, lalu pindahkan ke stoples yang sudah disterilkan (jika ingin disimpan lebih dari dua minggu). Akan disimpan, belum dibuka, selama enam bulan.",
      "3). Belah dua alpukat dan masukkan ke dalam mangkuk. Tambahkan setengah air jeruk nipis dan sedikit garam, lalu haluskan dengan garpu.",
      "4). Masukkan bawang bombay ke dalam mangkuk kecil, tuangkan sisa air jeruk nipis dan bumbui dengan sedikit garam. Aduk rata dan sisihkan hingga menjadi acar ringan.",
      "5). Panaskan sedikit minyak dalam wajan besar atau panaskan air-fryer hingga 200C selama 4 menit. Jika Anda menggunakan kompor, letakkan irisan chorizo di satu sisi wajan dan halloumi di sisi lainnya, balikkan setelah halloumi berwarna keemasan dan chorizo mendesis. Masak total sekitar 4-5 menit. Jika Anda menggunakan alat penggoreng udara, susun irisan chorizo dan halloumi dalam satu lapisan di sisi keranjang yang berlawanan. Jika tidak ada cukup ruang, masak secara terpisah secara bertahap. Goreng di udara terbuka selama 8-10 menit sampai halloumi berwarna keemasan dan chorizo berwarna kecoklatan di tepinya.",
      "6). Belah baguette dan hangatkan dalam air-fryer atau oven selama 1-2 menit.",
      "7). Sebarkan alpukat di satu sisi baguette dan selai tomat di sisi lainnya.",
      "8). Isi baguette dengan halloumi, chorizo, ketumbar, dan acar bawang merah. Potong dan sajikan."
    ],
    "slug": "baguette chorizo halloumi",
    "isFavorite": false,
    "search_record": 0
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/fish-pie-46465d3.jpg?quality=90&webp=true&resize=375,341",
    "healthyIngredients": [
      "1½ kg kentang, dikupas dan potong menjadi potongan-potongan kecil",
      "200ml susu rendah lemak",
      "2 sendok makan keju parmesan parut rendah lemak",
      "Garam dan merica secukupnya",
      "1 sendok makan minyak zaitun",
      "1 bawang bombay, cincang halus",
      "2 siung bawang putih, cincang halus",
      "2 batang daun bawang, iris tipis",
      "300g ikan putih (misalnya cod, haddock, atau pollock), potong menjadi potongan kecil",
      "150g udang tanpa kulit, kupas ekor dan belah punggungnya",
      "200ml kaldu ikan rendah sodium",
      "100ml susu rendah lemak",
      "1 sendok makan tepung terigu serbaguna",
      "1 sendok teh mustard Dijon",
      "1 sendok teh jus lemon segar",
      "2 sendok makan daun peterseli cincang halus"
    ],
    "healthySteps": [
      "1). Rebus kentang yang sudah dipotong dalam air mendidih yang diberi sedikit garam hingga empuk, sekitar 15-20 menit.",
      "2). Tiriskan kentang dan haluskan dengan bantuan alat penumbuk atau garpu.",
      "3). Tambahkan susu rendah lemak, keju parmesan parut rendah lemak, garam, dan merica. Aduk hingga halus dan rata. Sisihkan.",
      "4). Panaskan minyak zaitun dalam wajan besar di atas api sedang. Tumis bawang bombay, bawang putih, dan daun bawang hingga harum dan lembut.",
      "5). Tambahkan potongan ikan dan udang. Masak hingga ikan matang dan udang berubah warna menjadi merah muda Dalam mangkuk terpisah, campurkan kaldu ikan rendah sodium, susu rendah lemak, tepung terigu, mustard Dijon, jus lemon, garam, dan merica. Aduk rata.",
      "6). Tuangkan campuran kaldu ke dalam wajan dengan ikan dan udang. Masak sambil terus diaduk hingga saus mengental. Tambahkan daun peterseli cincang halus. Aduk rata.",
      "7). Panaskan oven suhu 200°C.",
      "8). Tuang campuran pai ikan ke dalam loyang pai yang telah diolesi dengan sedikit minyak.",
      "9). Ratakan tumbukan kentang di atasnya. Panggang selama 20-25 menit hingga pai berwarna keemasan. Sajikan hangat."
    ],
    "healthyCalories": 2050,
    "description": "Ikan Krim & Pai Daun Bawang adalah hidangan lezat yang menggabungkan ikan yang lembut dan krim yang kaya dengan sentuhan segar dari daun bawang. Hidangan ini menyajikan kombinasi harmonis antara rasa dan tekstur yang membuatnya menjadi hidangan yang menggugah selera.",
    "ingredients": [
      "1½ kg kentang Rooster atau Maris Piper, tidak dikupas",
      "200ml krim kental",
      "50ml susu",
      "50g keju cheddar parut",
      "50g keju parmesan parut",
      "100g mentega",
      "3 batang daun bawang, iris tipis",
      "1/4 sdt bubuk pala",
      "1½ sdm mustard biji utuh",
      "100ml anggur putih kering atau vermouth kering",
      "200ml krim kental",
      "½ ikat kecil daun bawang, cincang",
      "½ buah lemon, parut kulitnya dan peras airnya",
      "125g ikan haddock asap, tanpa kulit, potong besar-besar",
      "125g ikan salmon tanpa kulit, potong besar-besar",
      "125g udang raja mentah"
    ],
    "id": 13,
    "calories": 3250,
    "title": "Ikan krim & Pai Daun bawang",
    "steps": [
      "1). Panaskan oven suhu 200°C/180°C (kipas)/gas 6. Tusukkan setiap kentang beberapa kali dengan pisau (untuk mencegah meledak) dan panggang dalam nampan pemanggang selama 1 jam hingga 1 jam 30 menit atau hingga empuk saat ditekan.",
      "2). Belah kentang menjadi dua bagian dan kerok dagingnya ke dalam mangkuk, lalu tumbuk dengan garpu atau alat penumbuk kentang. Simpan kulit kentang untuk lain waktu. Saat kentang masih panas, campurkan krim dan susu ke dalamnya untuk membuat tumbukan yang halus, beri bumbu secukupnya, lalu sisihkan.",
      "3). Saat kentang dipanggang, buat campuran pai ikan. Panaskan wajan besar dengan api sedang. Lelehkan mentega dan masak daun bawang dengan perlahan selama 10 menit hingga menjadi manis dan lembut, lalu beri bumbu secukupnya dan tambahkan bubuk pala.",
      "4). Aduk masuk mustard, lalu tuangkan anggur dan didihkan hingga hampir tidak ada anggur tersisa. Tuangkan krim dan biarkan mendidih selama sekitar 10 menit hingga berkurang setengahnya. Angkat dari api, tambahkan daun bawang dan jus serta parutan kulit lemon. Cicipi untuk penyesuaian rasa.",
      "5). Aduk ikan haddock, salmon, dan udang ke dalam campuran krim dan daun bawang, lalu pindahkan ke dalam pinggan panggang sedang, lalu tutupi dengan kentang tumbuk, ratakan hingga menutupi ikan, dan taburi dengan keju. Panggang selama 25-30 menit hingga keju berwarna kuning kecokelatan. Sajikan dengan sayuran hijau."
    ],
    "slug": "ikan krim pai daun bawang",
    "isFavorite": false
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/Buttermilk-corn-pancakes-bbcf390.jpg?quality=90&webp=true&resize=375,341",
    "healthyIngredients": [
      "75g tepung jagung halus atau polenta",
      "125g tepung terigu serbaguna",
      "1 sendok teh baking powder",
      "4 putih telur, dikocok hingga kaku",
      "110ml susu rendah lemak",
      "1 sendok makan minyak nabati",
      "300g jagung manis, beku atau kalengan",
      "4 batang daun bawang, cincang, ditambah beberapa untuk taburan",
      "8 potong bacon tanpa lemak",
      "Sirup maple rendah kalori, untuk disajikan"
    ],
    "healthySteps": [
      "1). Dalam sebuah mangkuk, campurkan tepung jagung, tepung terigu, dan baking powder.",
      "2). Tambahkan putih telur yang sudah dikocok kaku dan susu rendah lemak. Aduk rata.",
      "3). Panaskan wajan datar dengan api sedang dan semprotkan sedikit minyak.",
      "4). Tuang adonan pancake sebesar 1/4 cangkir ke dalam wajan untuk membuat pancake kecil. Tambahkan beberapa butir jagung manis dan sejumput daun bawang di atas setiap pancake.",
      "5). Biarkan pancake matang sekitar 2-3 menit atau sampai muncul gelembung kecil di permukaannya. Balik pancake dan masak di sisi lain selama 1-2 menit lagi.",
      "6). Angkat pancake dan letakkan di atas piring saji. Ulangi proses yang sama hingga adonan habis.",
      "7). Panaskan wajan dengan api sedang dan panggang bacon punggung tanpa lemak hingga kecokelatan dan renyah.",
      "8). Sajikan pancake dengan bacon panggang di atasnya dan sirup maple rendah kalori."
    ],
    "healthyCalories": 1500,
    "description": "Buttermilk Corn Pancakes with Bacon & Maple Syrup adalah hidangan sarapan atau brunch yang lezat yang menggabungkan kelezatan jagung manis, keasaman susu kultur, kelezatan daging bacon, dan cita rasa kaya sirup maple. Pancake ini memberikan variasi unik pada hidangan klasik pancake dengan sentuhan jagung yang manis dan aroma gurih dari bacon yang digoreng renyah. Sirup maple memberikan sentuhan manis alami yang sempurna untuk menyeimbangkan semua rasa dalam hidangan ini.",
    "ingredients": [
      "75g tepung jagung halus atau polenta",
      "125g tepung terigu serbaguna",
      "1 sendok teh baking powder",
      "1 sendok teh baking powder",
      "110ml susu kultur (buttermilk)",
      "60g mentega, lelehkan dan dinginkan",
      "300g jagung manis, beku atau kalengan",
      "4 batang daun bawang, cincang, ditambah beberapa untuk taburan",
      "Minyak kacang tanah atau minyak bunga matahari, untuk menggoreng",
      "8 potong bacon",
      "Sirup maple, untuk disajikan"
    ],
    "id": 14,
    "calories": 2515,
    "title": "Buttermilk Corn Pancakes with Bacon & Maple Syrup",
    "steps": [
      "1). Panaskan oven pada suhu 150°C/130°C (kipas)/gas 2 - oven akan digunakan untuk menjaga pancake tetap hangat.",
      "2). Letakkan tepung jagung, tepung terigu, baking powder, telur, susu kultur, mentega leleh, dan setengah bagian jagung manis ke dalam mangkuk pengolah makanan dan pulsakan hingga tercampur (tujuannya adalah membuat jagung terpotong, bukan menjadi halus). Tambahkan daun bawang dan jagung manis yang tersisa, aduk rata.",
      "3). Panaskan dua wajan pada api sedang, dan tambahkan sekitar 1 sendok makan minyak pada masing-masing wajan.",
      "4). Tuangkan adonan pancake sebanyak dua sendok sayur, dengan diameter sekitar 10-12cm, ke dalam setiap wajan. Masak selama sekitar 3-4 menit hingga matang dan muncul gelembung kecil di permukaannya.",
      "5). Gunakan spatula, balik pancake dan masak di sisi lain selama 2-3 menit lagi. Pindahkan pancake yang sudah matang ke dalam loyang panggang atau loyang pembakar yang dilapisi dengan dua lapis kertas baking, dan letakkan di dalam oven agar tetap hangat.",
      "6). Setelah semua pancake matang, tambahkan sedikit minyak pada wajan, lalu masak bacon hingga keemasan di kedua sisinya. Sajikan pancake bersama bacon, sirup maple yang diteteskan di atasnya, dan taburan daun bawang tambahan."
    ],
    "slug": "buttermilk corn pancakes with bacon maple syrup",
    "isFavorite": false
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lobster_mac_cheese-0de5850.jpg?quality=90&webp=true&resize=375,341",
    "description": "Lobster Mac n Cheese adalah hidangan yang menggabungkan cita rasa mewah dari lobster dengan kelezatan dan kenikmatan klasik dari macaroni and cheese. Hidangan ini menghadirkan perpaduan sempurna antara daging lobster yang lezat, keju meleleh yang kaya, dan pasta macaroni yang mengenyangkan.",
    "ingredients": [
      "1 ekor lobster beku (sekitar 500g), dicairkan",
      "1 sendok makan minyak zaitun",
      "1 bawang bombay, cincang kasar",
      "Sejumput cabai cayenne",
      "1 sendok makan pasta tomat",
      "1 liter susu",
      "400g makaroni",
      "50g mentega",
      "150ml anggur putih",
      "50g tepung terigu serbaguna",
      "150g daging kepiting cangkang cokelat (atau campuran setengah putih dan setengah cokelat)",
      "1 sendok teh mustard Dijon",
      "160g keju cheddar ekstra tua, parut, ditambah tambahan untuk taburan",
      "2 siung bawang putih",
      "2 sendok makan minyak zaitun",
      "50g tepung roti",
      "Kulit lemon, parut"
    ],
    "id": 15,
    "title": "Lobster Mac n Cheese",
    "steps": [
      "1). Ambil lobster dan putar cangkangnya, kemudian gunakan rolling pin untuk memecahkan cangkang dan mengambil dagingnya. Kupas ekor, mengungkapkan dan menghilangkan dagingnya.",
      "2). Cincang kasar semua daging, kemudian tutup dan sisihkan dalam mangkuk di dalam lemari es. Pukul semua bagian cangkang dengan rolling pin untuk memecahnya sedikit.",
      "3). Panaskan minyak di wajan besar dengan api tinggi, tambahkan bawang bombay dan sejumput garam besar, dan masak selama sekitar lima menit hingga lunak dan berwarna.",
      "4). Tambahkan cangkang lobster dan tumis selama beberapa menit lagi.",
      "5). Tambahkan cabai cayenne dan pasta tomat, aduk rata, lalu tuangkan susu dan didihkan.",
      "6). Sementara itu, campurkan bawang putih, minyak zaitun, dan kulit lemon dengan sedikit garam dan merica untuk membuat taburan roti panggang, lalu sisihkan. Saring campuran susu ke dalam sebuah gelas pengukur dan buang cangkangnya.",
      "7). Panaskan oven pada suhu 180°C/160°C (kipas)/gas 4. Rebus makaroni dalam air yang diberi garam sampai sedikit kenyal (sekitar dua menit lebih sedikit dari instruksi di kemasan), tiriskan dan sisihkan.",
      "8). Lelehkan mentega dalam wajan besar dengan api sedang hingga berbusa, lalu tambahkan anggur dan masak selama 5 menit hingga anggur mengurangi volumenya menjadi setengahnya, kemudian aduk tepung terigu hingga membentuk pasta berbutiran.",
      "9). Turunkan api dan tuangkan susu yang sudah disaring ke dalam wajan sedikit demi sedikit sambil terus mengaduk dan membiarkan setiap penambahan susu diserap sepenuhnya sebelum menambahkan susu berikutnya.",
      "10). Tambahkan daging lobster cincang, mustard, daging kepiting, dan keju. Aduk rata hingga keju meleleh, lalu beri bumbu sesuai selera. Tambahkan makaroni dan aduk hingga terbalut saus.",
      "11). Tuang ke dalam pinggan tahan panas (atau enam pinggan kecil) dan taburi dengan keju parut dan taburan roti panggang bawang putih. Panggang selama 20 menit hingga kecokelatan dan berbuih, lalu biarkan sedikit dingin sebelum disajikan."
    ],
    "healthyIngredients": [
      "1 ekor lobster beku (sekitar 500g), dicairkan",
      "1 sendok teh minyak zaitun",
      "1 bawang bombay, cincang halus",
      "2 sendok makan tepung terigu serbaguna rendah protein",
      "400g makaroni gandum utuh",
      "400ml susu rendah lemak",
      "1 sendok teh mustard Dijon",
      "100g keju cheddar rendah lemak, parut",
      "1/4 sendok teh merica bubuk",
      "1/4 sendok teh garam",
      "2 sendok makan tepung roti gandum utuh",
      "1 sendok teh minyak zaitun",
      "1 sendok makan peterseli cincang (opsional)"
    ],
    "healthySteps": [
      "1). Panaskan oven pada suhu 180°C/160°C (kipas)/gas 4. Rebus makaroni dalam air mendidih yang diberi garam sesuai petunjuk pada kemasan. Tiriskan dan sisihkan.",
      "2). Panaskan minyak zaitun dalam wajan besar dan tumis bawang bombay dan bawang putih hingga harum dan lunak.",
      "3). Tambahkan lobster yang sudah dicincang dan masak hingga berubah warna menjadi merah muda.",
      "4). Taburkan tepung terigu di atas lobster dan bawang yang sudah dimasak. Aduk rata dan masak selama 1-2 menit untuk menghilangkan rasa tepung mentah.",
      "5). Tuangkan susu rendah lemak secara perlahan sambil terus diaduk hingga membentuk saus yang kental dan mulus.",
      "6). Tambahkan mustard Dijon, keju cheddar rendah lemak, merica, dan garam. Aduk rata hingga keju meleleh dan saus mengental.",
      "7). Masukkan makaroni ke dalam saus lobster dan aduk hingga tercampur rata.",
      "8). Siapkan topping dengan mencampurkan tepung roti gandum utuh dengan minyak zaitun.",
      "9). Pindahkan campuran makaroni dan saus ke dalam pinggan tahan panas. Taburkan topping tepung roti di atasnya.",
      "10). Panggang dalam oven yang sudah dipanaskan selama 20-25 menit atau hingga permukaannya berwarna kecokelatan dan renyah.",
      "11). Angkat dari oven dan taburkan peterseli cincang sebagai hiasan (opsional)."
    ],
    "calories": 4500,
    "healthyCalories": 3000,
    "isFavorite": false,
    "slug": "lobster mac n cheese"
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-418_11-dfd66c8.jpg?quality=90&webp=true&resize=375,341",
    "healthySteps": [
      "1). Panaskan oven pada suhu 190°C.",
      "2). Belah sosis dan keluarkan dari kulitnya. Potong sosis menjadi potongan-potongan kecil.",
      "3). Panaskan minyak zaitun dalam panci, tambahkan bawang bombay, dan tumis selama 5 menit hingga lembut dan berwarna kecokelatan.",
      "4). Tambahkan potongan sosis dan tumis hingga berwarna kecokelatan.",
      "5). Masukkan wortel parut, kaldu ayam rendah garam, dan pasta tomat. Aduk rata dan biarkan mendidih. Kecilkan api dan biarkan selama 10-15 menit hingga saus mengental. Bumbui dengan garam dan merica sesuai selera.",
      "6). Sementara itu, rebus rigatoni sesuai petunjuk pada kemasan. Setelah matang, tambahkan bayam segar ke dalam panci dan aduk hingga bayam layu. Tiriskan pasta dan bayam.",
      "7). Campurkan rigatoni dan bayam dengan saus sosis yang telah dibuat. Aduk rata.",
      "8). Tuang campuran pasta ke dalam wadah tahan panas. Taburkan keju cheddar rendah lemak di atasnya.",
      "9). Panggang dalam oven yang telah dipanaskan selama 20-25 menit atau hingga keju meleleh dan berwarna kecokelatan.",
      "10). Sajikan Sosis Panggang Rigatoni rendah kalori ini selagi hangat."
    ],
    "healthCalories": 3500,
    "healthyIndgredients": [
      "400g sosis ayam atau sosis rendah lemak",
      "1 sendok makan minyak zaitun",
      "1 bawang bombay, cincang",
      "1 wortel besar, parut",
      "150ml kaldu ayam rendah garam",
      "3 sendok makan pasta tomat",
      "500g rigatoni gandum utuh",
      "200g bayam segar",
      "140g keju cheddar rendah lemak, parut"
    ],
    "description": "Rigatoni Sausage Bake adalah hidangan panggang yang menggabungkan kelezatan pasta rigatoni dengan cita rasa gurih dari sosis. Hidangan ini merupakan kombinasi yang mengenyangkan dan memuaskan, cocok untuk dinikmati sebagai hidangan utama dalam acara makan malam keluarga atau pertemuan santai dengan teman-teman.",
    "ingredients": [
      "400g sosis",
      "1 sendok makan minyak zaitun",
      "1 bawang bombay, cincang",
      "1 wortel besar, parut",
      "150ml anggur merah",
      "300ml kaldu sayuran",
      "3 sendok makan pasta tomat",
      "50g mentega",
      "50g tepung terigu serbaguna",
      "600ml susu",
      "Bubuk pala secukupnya",
      "500g rigatoni atau penne",
      "200g bayam segar",
      "140g keju cheddar tua, parut"
    ],
    "id": 16,
    "calories": 4000,
    "title": "Sosis Panggang Rigatoni",
    "steps": [
      "1). Belah sosis dan keluarkan dari kulitnya, kemudian potong menjadi potongan kecil. Panaskan minyak zaitun dalam panci, tambahkan bawang bombay, dan tumis selama 5 menit hingga lembut dan berwarna kecokelatan.",
      "2). Masukkan potongan sosis dan tumis hingga berwarna kecokelatan. Tambahkan wortel, lalu tuangkan anggur, kaldu sayuran, pasta tomat, dan bumbui dengan garam dan merica. Aduk rata.",
      "3). Didihkan, lalu kecilkan api dan biarkan terbuka sekitar 15 menit hingga mengental. Cicipi dan bumbui sesuai selera. Sisihkan.",
      "4). Masukkan mentega, tepung terigu, dan susu ke dalam panci. Panaskan dengan api kecil sambil aduk perlahan hingga mengental dan halus. Tambahkan bubuk pala segar secukupnya, bumbui dengan garam, dan biarkan mendidih selama 2 menit.",
      "5). Panaskan oven pada suhu 190C/ Gas 5/ fan 170C. Didihkan panci besar berisi air garam. Masukkan pasta, aduk rata, dan masak terbuka selama 10-12 menit hingga matang. Angkat dari api, tambahkan bayam, dan setelah layu, tiriskan dengan baik.",
      "6). Tuang setengah bagian pasta ke dalam wadah tahan panas dangkal dengan kapasitas sekitar 2,2 liter/4 pinta, dan ratakan. Sendokkan saus sosis di atasnya, lalu tutup dengan pasta yang tersisa. Tuang saus putih merata di atasnya dan taburkan keju cheddar. Panggang selama 20-25 menit hingga kecokelatan. Biarkan selama 5 menit sebelum disajikan."
    ],
    "slug": "sausage rigatoni bake",
    "isFavorite": false
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/yorkshire-pudding-wrap-33ceed8.jpg?quality=90&webp=true&resize=375,341",
    "healthyIngredients": [
      "100g tepung terigu serbaguna",
      "2 butir telur",
      "200ml susu rendah lemak",
      "1 sendok makan minyak sayur",
      "25g kacang polong beku",
      "50g daun bayam segar",
      "2 sendok makan saus horseradish rendah kalori",
      "1 sendok teh mustard Dijon rendah kalori",
      "150g irisan daging sapi panggang rendah lemak",
      "50ml kuah daging sapi rendah lemak"
    ],
    "healthySteps": [
      "1). Panaskan oven pada suhu 220°C.",
      "2). Dalam mangkuk, campurkan tepung terigu, telur, dan susu rendah lemak. Kocok hingga adonan halus dan bergerindil. Diamkan selama 30 menit untuk mengembangkan adonan.",
      "3). Panaskan minyak sayur dalam loyang panggang persegi besar (sekitar 20cm x 20cm) di dalam oven selama 10 menit.",
      "4). Setelah loyang panas, tuangkan adonan Yorkshire pudding ke dalam loyang dan panggang selama 20-25 menit atau sampai Yorkshire pudding mengembang dan berwarna keemasan.",
      "5). Sementara itu, rebus kacang polong dan bayam dalam air mendidih selama 2-3 menit atau sampai kacang polong lunak. Tiriskan dengan baik.",
      "6). Setelah Yorkshire pudding matang, keluarkan dari loyang dan biarkan dingin sejenak. Pipihkan dengan bagian belakang sendok.",
      "7). Olesi saus horseradish rendah kalori dan mustard Dijon rendah kalori pada permukaan Yorkshire pudding.",
      "8). Letakkan irisan daging sapi panggang rendah lemak, kacang polong, dan bayam di atas saus.",
      "9). Gulung Yorkshire pudding dengan rapat dan potong menjadi beberapa bagian.",
      "10). Sajikan Yorkshire Pudding Wrap rendah kalori ini dengan kuah daging sapi rendah lemak."
    ],
    "healthyCalories": 1200,
    "description": "Salad is a dish consisting of pieces of food in a mixture, with at least one raw ingredient.",
    "ingredients": [
      "150g tepung terigu serbaguna",
      "3 butir telur",
      "300ml susu full cream atau susu rendah lemak",
      "2 sendok makan minyak sayur",
      "50g kacang polong beku",
      "100g daun kale",
      "2 sendok makan saus horseradish",
      "1 sendok makan mustard Inggris",
      "200g irisan daging sapi panggang",
      "100ml kaldu daging sapi"
    ],
    "id": 17,
    "calories": 2150,
    "title": "Yorkshire Pudding Wrap",
    "steps": [
      "1). Kocok tepung, telur, dan susu bersama dengan sedikit garam hingga halus. Tutup dan diamkan selama 30 menit (atau dinginkan dalam kulkas semalaman).",
      "2). Panaskan oven pada suhu 220°C/200°C (kipas)/gas 7 dan siapkan panci besar berisi air yang ditambahkan garam untuk direbus. Panaskan minyak dalam loyang panggang besar (sekitar 40cm x 30cm) di dalam oven selama 10 menit. Setelah panas, tuangkan adonan dan masak selama 25 menit atau hingga mengembang dan berwarna keemasan.",
      "3). Sementara itu, masukkan kacang polong dan daun kale ke dalam air mendidih dan masak selama 2-3 menit hingga lunak. Tiriskan dengan baik dan beri bumbu.",
      "4). Saat puding keluar dari oven, keluarkan dari loyang, pipihkan dengan bagian belakang sendok logam besar, dan belah menjadi dua bagian secara memanjang. Olesi 1 sendok makan horseradish di setiap bagian, diikuti dengan mustard, irisan daging sapi, kacang polong, daun kale, dan kuah daging sapi. Bungkus dan sajikan."
    ],
    "slug": "yorkshire pudding wrap",
    "isFavorite": false
  },
  {
    "photoUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/smoky-steak-with-cajun-potatoes-spicy-slaw-0da6a16.jpg?quality=90&webp=true&resize=375,341",
    "healthyIngredients": [
      "430g kentang Maris Piper, potong menjadi potongan 1,5cm",
      "1 sendok makan bumbu Cajun rendah garam",
      "2 sendok teh minyak zaitun",
      "1 x 400g daging sapi sirloin",
      "1/4 ikat kecil ketumbar, cincang halus",
      "1/4 kubis ungu kecil, iris tipis",
      "1/2 bawang merah, iris halus",
      "2 sendok makan mayones rendah lemak",
      "1 sendok makan yoghurt Yunani rendah lemak",
      "1/2 sendok makan pasta cabai chipotle"
    ],
    "healthySteps": [
      "1). Panaskan oven pada suhu 220°C/200°C (kipas)/gas 7. Didihkan panci besar berisi air garam, tambahkan kentang, dan masak selama 5 menit. Tiriskan dan biarkan mengering di dalam saringan selama beberapa menit.",
      "2). Campur kentang dengan bumbu Cajun rendah garam, 1 sendok teh minyak zaitun, dan sejumput garam. Tuang kentang ke dalam loyang panggang dan panggang selama 25-30 menit atau hingga keemasan dan renyah, aduk sekali di tengah proses pemanggangan.",
      "3). Untuk membuat slaw, campurkan kubis, bawang merah, mayones rendah lemak, yoghurt Yunani rendah lemak, dan pasta cabai chipotle rendah garam dalam sebuah mangkuk hingga kubis dan bawang terlapisi dengan baik. Sisihkan.",
      "4). Gosok daging sapi dengan 1 sendok teh minyak zaitun dan beri bumbu pada kedua sisinya. Panaskan wajan panggangan atau wajan anti lengket di atas api tinggi hingga sangat panas.",
      "5). Masukkan daging sapi ke dalam wajan, masak selama 2-3 menit di satu sisi, lalu 3-4 menit di sisi lainnya. Angkat, letakkan di atas papan potong, tutup dengan aluminium foil, dan biarkan istirahat selama 5 menit. Iris daging menjadi strip.",
      "6). Sajikan daging sapi dengan kentang yang ditaburi ketumbar dan tumpukan slaw pedas."
    ],
    "healthyCalories": 1450,
    "description": "A pancake is a flat cake, often thin and round, prepared from a starch-based batter that may contain eggs, milk and butter and cooked on a hot surface such as a griddle or frying pan, often frying with oil or butter.",
    "ingredients": [
      "430g kentang Maris Piper, potong menjadi potongan 1,5cm",
      "1 sendok makan bumbu Cajun",
      "2 sendok makan minyak zaitun",
      "1 x 400g daging sapi bavette",
      "1/4 ikat kecil ketumbar, cincang halus",
      "1/4 kubis ungu kecil, iris tipis",
      "1/2 bawang merah, iris halus",
      "2 sendok makan mayones",
      "1 sendok makan krim asam",
      "1/2 sendok makan pasta cabai chipotle"
    ],
    "id": 18,
    "calories": 1950,
    "title": "Steak Panggang dengan Kentang Cajun & Slaw Pedas",
    "steps": [
      "1). Panaskan oven pada suhu 220°C/200°C (kipas)/gas 7. Didihkan panci besar berisi air garam, tambahkan kentang, dan masak selama 5 menit. Tiriskan dan biarkan mengering di dalam saringan selama beberapa menit.",
      "2). Campur kentang dengan bumbu Cajun, setengah bagian minyak, dan sejumput garam. Tuang kentang ke dalam loyang panggang dan panggang selama 25-30 menit atau hingga keemasan dan renyah, aduk sekali di tengah proses pemanggangan.",
      "3). Untuk membuat slaw, campurkan kubis, bawang merah, mayones, krim asam, dan pasta cabai chipotle dalam sebuah mangkuk hingga kubis dan bawang terlapisi dengan baik. Sisihkan.",
      "4). Gosok daging sapi dengan sisa minyak dan beri bumbu pada kedua sisinya. Panaskan wajan panggangan atau wajan anti lengket di atas api tinggi hingga sangat panas.",
      "5). Masukkan daging sapi ke dalam wajan, masak selama 2 menit di satu sisi, lalu 3 menit di sisi lainnya. Angkat, letakkan di atas papan potong, tutup dengan aluminium foil, dan biarkan istirahat selama 5 menit. Iris daging menjadi strip.",
      "6). Sajikan daging sapi dengan kentang yang ditaburi ketumbar dan tumpukan slaw pedas."
    ],
    "slug": "smoky steak with cajun potatoes spicy slaw",
    "isFavorite": false
  },
  {
    "id": 2,
    "isFavorite": false,
    "description": "Bika Ambon adalah kue tradisional khas Medan, Indonesia. Kue ini terbuat dari bahan-bahan seperti tepung tapioka, telur, gula, dan santan. Bika ambon dimasak selama 12 jam agar dapat bertahan dalam kondisi terbaik dan sesuai apa yang diinginkan selama empat hari karena setelahnya kue tersebut mulai mengeras. Kue basah ini biasanya memiliki jaring-jaring pada bagian dalam. Bika ambon juga dijual dengan berbagai macam rasa, seperti pandan, coklat, keju, dan lain-lain.",
    "calories": 77,
    "healthyCalories": 65,
    "photoUrl": "https://asset.kompas.com/crops/y6kf_9gs-aeXJBCt-0jdFyCUsPU=/0x0:1000x667/750x500/data/photo/2023/09/15/6503f5d0c90c0.jpg",
    "healthyIngredients": [
      "1 sdt ragi",
      "1 sdt gula pasir",
      "50 ml air hangat",
      "Adonan santan",
      "50 gr fiber creme atau 1 sachet santan kara kecil",
      "200 ml air rebusan 5 lembar daun jeruk dan sereh iris",
      "Pewarna kuning 2 tetes sesuai selera",
      "5 sachet gula tropicana atau 100 gr gula",
      "100 gr kanji dan 50 gr terigu atau 150 gr kanji saja",
      "1/2 sdt garam",
      "2 butir telur kocok lepas",
      "1 sdm margarin dicairkan"
    ],
    "healthySteps": [
      "1). Campur adonan ragi biarkan beberapa menit hingga terlihat buih2 pada bagian atas, tanda ragi aktif, sisihkan.",
      "2). Didihkan 200 ml air dengan daun jeruk dan sereh, lalu diamkan hangat kuku dan campurkan dengan fiber creme aduk2 hingga larut semuanya, lalu sisihkan.",
      "3). Campurkan adonan ragi, adonan santan, telur, gula, garam, tepung kanji, dan margarin cair dengan wisk hingga tercampur rata tambahkan pewarna, lalu tutup dengan lap basah dan diamkan minimal 1 jam, atau sampai bagian atas adonan terdapat buih.",
      "4). Panaskan cetakan hingga panas, jangan lupa alasi cetakan, lalu kecilkan apinya. Aduk dahulu adonan sebelum di masukan ke dalam cetakan apem, 3/4 dari cetakan. Diamkan hingga berpori dan bagian atasnya agak kering lalu tutup hingga matang. Keluarkan dari cetakan.",
      "5). Lakukan hingga selesai semua. Sajikan."
    ],
    "ingredients": [
      "100 gr tepung tapioka",
      "50 gr tepung terigu",
      "100 gr gula pasir",
      "250 ml santan, rebus dengan 4 lembar pandan dan 4 lembar jeruk dan 1 sdt kunyit bubuk",
      "2 buah telur, kocok lepas",
      "1 sdm mentega, cairkan",
      "1/4 sdt garam dan vanili",
      "1 sdm minyak sayur",
      "1 sdt gula",
      "1 sdt fermipan"
    ],
    "steps": [
      "1). Campur semua bahan biang, diamkan 10 menit. Kemudian Di wadah lain, campur tepung terigu, tapioka, bahan biang, garam, vanili, gula, separuh santan, sampai adonan halus.",
      "2). Masukkan sisa santan dan telur kocok lepas, tambahkan minyak dan mentega aduk rata, diamkan satu jam.",
      "3). Siapkan Snack maker (pakai yg 12 lubang), panaskan lalu tuangi adonan 3/4 nya saja, biarkan terbuka sampai adonan matang, lalu tutup sebentar, angkat dan sajikan."
    ],
    "title": "Bika Ambon",
    "slug": "bika ambon",
    "search_record": 1
  },
  {
    "photoUrl": "https://asset.kompas.com/crops/5-FXu0rkpP6nxD9vgw0-lIzggjs=/0x0:1000x667/750x500/data/photo/2021/08/04/610a2b1f96f46.jpg",
    "healthyIngredients": [
      "250 gr kelapa muda (parut)",
      "1/2 sdt garam himalaya",
      "100 ml gula aren cair",
      "2 lembar daun pandan",
      "125 gr tepung singkong",
      "1 sdm tepung tapioka",
      "1/4 sdt garam",
      "1/2 sdt pasta taro",
      "1 sdm minyak sayur",
      "1 butir telur",
      "50 ml air rendaman bunga telang",
      "300 ml santan cair (1 bungkus santan kara 65 ml + air)"
    ],
    "healthyCalories": 90,
    "id": 3,
    "calories": 120,
    "isFavorite": false,
    "search_record": 1,
    "description": "Dadar gulung merupakan jajanan tradisional yang tergolong dalam kue basah. Jajanan tersebut terbuat dari tepung terigu dan kelapa parut yang dipadukan gula merah atau yang disebut unti sebagai isiannya.",
    "title": "Dadar Gulung",
    "slug": "dadar gulung",
    "healthySteps": [
      "1). Cara membuat unti kelapa, masukan semua bahan ke wajan lalu aduk sampai merata dan tanak lalu sisihkan.",
      "2). Cara membuat adonan kulit yaitu masukkan semua bahan kedalam mangkok kecuali minyak sayur, lalu aduk hingga semua bahan merata lalu saring adonan untuk memastikan agar tidak ada adonan yg bergerindil dan tambahkan 1 sdm minyak sayur.",
      "3). Gunakan api kecil, panaskan teflon, beri sedikit olesan minyak di teflon, lalu tuang adonan dan putar hingga adonan merata. Tunggu hingga adonan matang lalu angkat dan sisihkan. ulangi hingga adonan habis.",
      "4). Ambil 1 lembar kulit dadar gulung, lalu beri isian unti kelapa lipat bagian bawah, bagian kanan dan kiri lalu gulung.",
      "5). Ulangi hingga semua kulit habis. Dadar gulung siap di nikmati."
    ],
    "ingredients": [
      "200 gr kelapa parut",
      "100 gr gula merah",
      "2 sdm gula pasir",
      "Air",
      "Garam",
      "100 gr tepung terigu",
      "Santan Kara",
      "3 tetes pasta pandan",
      "1 butir telur"
    ],
    "steps": [
      "1). Pertama kita membuat isian kelapa terlebih dahulu dengan cara merebus air hingga mendidih lalu masukan gula merah, gula putih dan garam aduk terus hingga larut, setelah itu masukan kelapa parut dan terus di aduk hingga tercampur rata dan kering.",
      "2). Setelah itu kita membuat kulit dadar gulung dengan cara mencampur tepung terigu, garam dan telur, santan kemudian masukkan air secara bertahap keadonan, dan aduk adonan hingga tercampur rata dan tidak ada gumpalan. Setelah itu tuangkan pasta pandan, dan aduk lagi hingga tercampur rata. Saring adonan untuk memastikan tidak bergindil.",
      "3). Panaskan wajan anti lengket hingga panas. Tuang 1 sendok sayur adonan (bisa disesuaikan denga lebar wajan) ratakan dan masak hingga matang, angkat dan ulangi terus hingga adonan habis.",
      "4). Isi kulit dengan kelapa lalu gulung dan hidangkan."
    ]
  },
  {
    "photoUrl": "https://cdn1-production-images-kly.akamaized.net/NIEhZEOZUsejftcrZu7RRiDWRKA=/0x251:5472x3335/680x383/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/3056755/original/049637700_1582267418-shutterstock_501315370.jpg",
    "healthyCalories": 120,
    "ingredients": [
      "130 gr tepung terigu",
      "100 gr gula pasir",
      "100 gr mentega yang sudah cairkan",
      "3 buah telur",
      "150 ml susu cair putih",
      "1/2 sdt baking powder",
      "1/4 sdt baking soda",
      "1/2 sdt vanili bubuk",
      "1/4 sdt garam"
    ],
    "id": 4,
    "calories": 180,
    "isFavorite": false,
    "search_record": 0,
    "title": "Kue Cubit",
    "slug": "kue cubit",
    "description": "Kue cubit merupakan jajanan populer di jakarta. kue berukuran kecil ini (diameter sekitar 4 cm) dan biasa dijajakan di depan sekolah oleh pedagang kaki lima. Kue cubit menggunakan campuran susu dan tepung terigu sebagai komponen utamanya. Adonan dimasukkan dalam cetakan baja dan dalam beberapa menit telah masak.",
    "healthyIngredients": [
      "Oat meal (pengganti tepung terigu) yang sudah di blender",
      "2 sdm fiber creme",
      "Susu cair rendah lemak (secukupnya)",
      "2 butir telur",
      "Madu tropika (pengganti gula)",
      "2 sdm margarin",
      "Vanila",
      "Baking Powder",
      "Toping (Kacang almond, Keju. Mesis coklat) bebas"
    ],
    "healthySteps": [
      "1). Masukkan telur dan juga madu mixer.",
      "2). Lalu masukkan oatmeal, fiber creme, susu cair, dan margarin mixer.",
      "3). Setelah halus dan adonan agak mengental lalu masukkan vanila dan juga baking powder.",
      "4). Diamkan adonan selama 7 menit.",
      "5). Setelah itu masak hingga matang."
    ],
    "steps": [
      "1). Siapkan bahan.",
      "2). Kocok telur dan gula hingga mengembang. Boleh memakai mixer atau whisk (opsional).",
      "3). Campur tepung terigu, baking powder, baking soda, vanili dan garam. Ayak lalu masukan ke dalam kocokan telur sedikit demi sedikit bergantian dengan susu. Tepung, susu, tepung, susu hingga tak ada yang bergerindil.",
      "4). Terakhir masukan mentega cair lalu aduk dengan spatula. Setelah rata, tutup adonan dengan serbet dan diamkan selama 30 menit.",
      "5). Kemudian panaskan cetakan yang sudah diberi olesan mentega atau margarin. Tuang adonan hingga setengah cetakan. Jangan terlalu penuh karena nanti akan mengembang. Beri topping mesis atau sesuai selera. Tutup sebentar sambil sesekali dilihat. Lalu angkat dan sajikan."
    ]
  },
  {
    "photoUrl": "https://cdn1-production-images-kly.akamaized.net/Sv0c3zbC-63ayFtWYMWb3wHK2I8=/680x383/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4240563/original/057419800_1669459104-christopher-alvarenga-rQX9eVpSFz8-unsplash__1_.jpg",
    "id": 5,
    "isFavorite": false,
    "search_record": 0,
    "title": "Nasi Goreng",
    "slug": "nasi goreng",
    "description": "Nasi goreng merupakan sajian nasi yang digoreng dalam sebuah wajan atau penggorengan yang menghasilkan cita rasa berbeda karena dicampur dengan bumbu-bumbu seperti garam, bawang putih, bawang merah, merica, rempah-rempah tertentu dan kecap manis. Selain itu, ditambahkan bahan-bahan pelengkap seperti telur, sayur-sayuran, makanan laut, atau daging. Makanan tersebut sering kali disantap sendiri atau disertai dengan hidangan lainnya.",
    "healthyIngredients": [
      "1 siung bawang putih",
      "2 siung bawang merah",
      "3 cabe rawit",
      "Kol",
      "1 butir telur",
      "Tahu",
      "1 sdm saos tiram",
      "1 sdm kecap manis",
      "1 sdt raja rasa",
      "1 sdt kecap asin",
      "Seasoning",
      "1 piring nasi"
    ],
    "ingredients": [
      "1 piring penuh nasi",
      "1 sdm jagung manis yang telah dipipil",
      "1 sdm kacang polong",
      "3 sdm daging ayam cincang yang telah ditumis",
      "1 butir telur lalu kocok",
      "1 sdt bawang putih (haluskan, tumis)",
      "1 sdm minyak ikan",
      "1 sdm kecap manis",
      "1/2 sdt garam",
      "Kaldu penyedap, secukupnya jika suka",
      "Sambal, secukupnya jika suka pedas",
      "Minyak goreng, secukupnya untuk memasak"
    ],
    "healthySteps": [
      "1). Siapkan telur bulat dan tahu di wajan anti lengket, grill sebentar.",
      "2). Masukkan dalam wadah saos tiram, kecap manis dan asin. Lalu bawang merah dan, bawang putih, cabe di iris.",
      "3). Siram di wajan yg berisi tahu tadi tambahkan juga irisan kol.",
      "4). Tunggu sebentar kemudian angkat tahu dan telurnya.",
      "5). Masukkan nasi aduk rata, beri rasa rasa dan seasoningnya, bisa tambah kecap sesuai selera."
    ],
    "steps": [
      "1). Siapkan semua bahan.",
      "2). Tumis bawang putih hingga harum kemudian masukkan telur. masak orak-arik bersama bawang putih.",
      "3). Tambahkan kacang polong dan jagung manis yang telah direbus sebelumnya. Masak beberapa saat.",
      "4). Tambahkan daging ayam cincang yang telah ditumis sebelumnya.",
      "5). Masukkan nasi putih ke dalam wajan. Aduk hingga rata.",
      "6). Tambahkan garam, minyak ikan, kecap, sambal dan penyedap sesuai selera. Aduk rata semua bahan.",
      "7). Koreksi rasa, angkat nasi goreng yang telah matang.",
      "8). Sajikan bersama sayur lalapan berupa wortel atau mentimun."
    ],
    "healthyCalories": 150,
    "calories": 350
  },
  {
    "photoUrl": "https://cdn0-production-images-kly.akamaized.net/0tQlDWUK1qSZGl52iNX4chMSgiw=/0x64:999x627/680x383/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4341755/original/028075400_1677641966-shutterstock_1150963166.jpg",
    "healthyCalories": 100,
    "id": 6,
    "calories": 167,
    "isFavorite": false,
    "search_record": 0,
    "title": "Pepes Ikan",
    "slug": "pepes ikan",
    "description": "Pepes ikan merupakan salah satu hidangan sehat tetapi tetap lezat. Sebab, proses pengukusan bisa membuat ikan lebih empuk, bumbu lebih meresap dan bisa mempertahankan nutrisinya.",
    "healthyIngredients": [
      "25 siung bawang putih",
      "15 siung bawang merah",
      "15 cabe rawit",
      "5 buah kemiri",
      "5 buah tomat ukuran kecil",
      "Garam",
      "Kecap manis",
      "Daun pisang",
      "Ikan laut fillet",
      "Tusuk gigi"
    ],
    "healthySteps": [
      "1). Haluskan bumbu, panaskan sebentar hingga mendidih setengah matang.",
      "2). Potong ikan sesuai selera.",
      "3). Siapkan daun pisang, letakkan 1 sdm bumbu, kemudian tata ikan diatas bumbu, tumpuk kembali dgn 1 sdm bumbu, kemudian bungkus.",
      "4). Kukus selama 20 menit atau hingga daun layu.",
      "5). Pepes ikan siap dimakan."
    ],
    "ingredients": [
      "Ikan Kembung",
      "1 buah jeruk nipis",
      "1 ikat kemangi",
      "2 buah tomat",
      "4 lembar daun salam",
      "2 lembar daun jeruk",
      "2 buah sereh",
      "10 buah cabai rawit utuh",
      "Garam dan gula secukupnya",
      "Daun pisang secukupnya",
      "6 siung bawang merah",
      "4 siung bawang putih",
      "5 buah cabai merah",
      "2 buah cabai rawit",
      "4 butir kemiri",
      "2 cm kunyit",
      "2 cm jahe",
      "1 sdt ketumbar",
      "Daun pisang",
      "Tusuk gigi"
    ],
    "steps": [
      "1). Bersihkan isi perut ikan dan sisiknya, kerat-kerat bagian punggungnya. Beri air jeruk nipis, diamkan selama 10 menit. Bilas bersih.",
      "2). Petik semua daun kemangi, potong dadu tomat, dan iris tipis serai bagian putihnya saja. ",
      "3). Tumis bumbu halus hingga wangi, masukkan daun salam dan daun jeruk, tumis hingga bumbu matang. Masukkan garam, gula dan cabai rawit, masak sebentar hingga cabai layu, tes rasa, jika sudah cukup asin, angkat.",
      "4). Ambil daun pisang yang sudah dibersihkan, letakkan ikan kembung lalu lumuri bumbu, beri daun kemangi, beberapa potong sereh dan cabai rawit. Bungkus pepesan. Lakukan hingga habis.",
      "5). Kukus selama 25 menit atau hingga matang."
    ]
  },
  {
    "photoUrl": "https://cdn1-production-images-kly.akamaized.net/kpAIxJfzmjLvOpBgu0BzmTPRFWo=/680x383/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/2414934/original/044558200_1542877024-shutterstock_261934301.jpg",
    "id": 7,
    "isFavorite": false,
    "title": "Putu Ayu",
    "slug": "putu ayu",
    "description": "Kue putu ayu adalah jajanan pasar yang dibuat dengan tepung sebagai bahan utamanya. Kue ini dibuat dengan cara dikukus dan disajikan dengan parutan kelapa. Biasanya putu ayu yang dibuat warga hegarmukti berwarna hijau dan putih dengan kombinasi rasa gurih dan manis yang sangat menggugah selera.",
    "healthyIngredients": [
      "2 telur ayam",
      "2 sachet agar plain",
      "1 sachet santan kara",
      "2 sachet gula rendah kalori",
      "3 sdm minyak",
      "Keju untuk toping pengganti parutan kelapa",
      "Pewarna makanan hijau rasa pandan",
      "Baking powder seujung kuku (optional)"
    ],
    "healthySteps": [
      "1). Kocok telur, gula, garam hingga mengembang, masukkan baking powder.",
      "2). Kemudian, masukan agar powder, santan kara, dan 3 sdm minyak, aduk rata menggunakan spatula (adonan berjejak).",
      "3). Panaskan kukusan, siapkan cetakan kue.",
      "4). Selagi memanaskan kukusan, oles mentega pada cetakan terlebih dahulu supaya tidak lengket, isi dengan parutan keju, isi adonan.",
      "5). Kukus hingga matang kurang lebih 30 menit.",
      "6). Putu ayu siap dihidangkan."
    ],
    "ingredients": [
      "250 gram tepung terigu",
      "225 gram gula pasir",
      "4 butir telur",
      "200 ml santan rebus",
      "1/2 sdt baking powder",
      "1/2 sdt sp",
      "Pasta pandan secukupnya",
      "Kelapa parut (kukus dan beri garam sedikit saja)",
      "Minyak sayur untuk mengoles cetakan agar tak lengket"
    ],
    "steps": [
      "1). Kocok telur, gula, baking powder, dan sp sampai mengembang kira-kira selama 15 menit.",
      "2). Masukan terigu dan santan yang telah direbus secara bergantian.",
      "3). Aduk sampai tercampur rata.",
      "4). Masukkan essense pandan.",
      "5). Aduk lagi sampai rata.",
      "6). Olesi cetakan dengan minyak.",
      "7). Masukkan kelapa parut dan tekan-tekan.",
      "8). Tuang adonan putu ayu.",
      "9). Kukus selama kurang lebih 15 menit.",
      "10). Angkat dan diamkan sebentar.",
      "11). Keluarkan dari cetakan.",
      "12). Sajikan."
    ],
    "search_record": 2,
    "calories": 150,
    "healthyCalories": 110
  },
  {
    "photoUrl": "https://cdn0-production-images-kly.akamaized.net/Ua9q1av_1pGLsczusnb22DV2tQc=/680x383/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4416362/original/027044400_1683267847-shutterstock_1939111798.jpg",
    "healthyCalories": 238,
    "id": 8,
    "calories": 193,
    "isFavorite": false,
    "search_record": 0,
    "slug": "rendang",
    "title": "Rendang",
    "healthyIngredients": [
      "Daging sapi, potong kecil",
      "4 buah cabai merah yang sudah di iris tipis",
      "4 buah cabai rawit yang sudah di iris tipis",
      "3 lembar daun jeruk",
      "2 batang serai yang sudah di memarkan",
      "2 cm jahe yang sudah di memarkan",
      "2 cm lengkuas yang sudah di memarkan",
      "3 lembar daun salam",
      "1 sdt jintan",
      "1 sdt ketumbar",
      "1 sdt gula kelapa",
      "2 sdt garam",
      "1 sdt minyak kelapa",
      "4 buah bawang merah",
      "3 siung bawang putih",
      "3 buah cabai merah",
      "3 buah cabai rawit",
      "2 cm jahe",
      "2 cm lengkuas",
      "1 sdt kunyit"
    ],
    "description": "Rendang adalah hidangan berbahan dasar daging yang dihasilkan dari proses memasak suhu rendah dalam waktu lama dengan menggunakan aneka rempah-rempah dan santan. Proses memasaknya memakan waktu berjam-jam (biasanya sekitar empat jam) hingga yang tinggal hanyalah potongan daging berwarna hitam pekat dan dedak. Dalam suhu ruangan, rendang dapat bertahan hingga berminggu-minggu. Rendang yang dimasak dalam waktu yang lebih singkat dan santannya belum mengering disebut kalio, berwarna cokelat terang keemasan.",
    "healthySteps": [
      "1). Panaskan minyak kelapa dalam wajan, tumis bumbu halus hingga harum.",
      "2). Masukkan daun salam, daun jeruk, serai, jahe, dan lengkuas. Tumis hingga harum.",
      "3). Masukkan daging sapi, aduk hingga berubah warna.",
      "4). Tambahkan gula kelapa, jintan, dan ketumbar. aduk rata.",
      "5). Tambahkan air secukupnya, masak hingga air menyusut dan bumbu meresap ke dalam daging.",
      "6). Masukkan cabai merah, cabai rawit, dan garam. Aduk rata.",
      "7). Masak hingga rendang matang dan bumbu meresap ke dalam daging."
    ],
    "ingredients": [
      "Daging sapi",
      "1 liter santan (kara)",
      "20 siung bawang merah",
      "10 siung bawang putih",
      "2 jempol jahe",
      "4 buah kemiri",
      "1/2 ons cabe besar/keriting",
      "15 biji cabe kecil",
      "1/2 ons laos",
      "1 sendok teh ketumbar",
      "1/2 sendok teh merica",
      "5 batang serai",
      "5 lembar daun salam",
      "5 lembar daun jeruk perut",
      "1 ruas jari kayu manis",
      "3 buah kapulaga",
      "2 buah bunga lawang",
      "5 buah cengkeh",
      "1/2 butir kelapa parut",
      "2 bungkus bumbu instan merek bamboo",
      "500 ml air",
      "2 bungkus masako",
      "2 sdm garam"
    ],
    "steps": [
      "1). Cuci bersih daging lalu potong-potong sesuai selera.",
      "2). Sangrai kelapa parut sampai berwarna kecoklatan dengan api kecil supaya tidak gosong. Kemudian blender atau ulek sampai keluar minyaknya lalu sisihkan.",
      "3). Sangrai semua bahan. lalu haluskan bawang merah, bawang putih, jahe, kemiri, cabai besar/keriting, cabe kecil, merica, ketumbar, kapulaga.",
      "4). Panaskan minyak lalu tumis bumbu halus sampai wangi, tambahkan bumbu rendang instan (merk bamboo).",
      "5). Masukkan daun salam, daun jeruk purut, serai, laos, bunga lawang, kayu manis, cengkeh. Aduk sampai wangi.",
      "6). Masukkan kelapa yang sudah di sangrai dan diulek/diblender sampai keluar minyaknya. Aduk rata.",
      "7). Masukkan daging lalu tambahkan air.",
      "8). Masukkan santan instan. Aduk sampai mendidih. jangan berhenti diaduk sampai santan mendidih. Lalu aduk sesekali agar tidak gosong.",
      "9). Aduk terus sampai 2 atau 3 jam. Tambahkan masako dan garam secukupnya."
    ]
  },
  {
    "photoUrl": "https://cdn0-production-images-kly.akamaized.net/i0E31DzGRrxN2UEEsHUjJGd1kJE=/1x66:1000x629/680x383/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/4462249/original/029077700_1686543353-shutterstock_2132031603.jpg",
    "healthyIngredients": [
      "250 g dada ayam fillet",
      "3 bawang putih",
      "Jeruk nipis",
      "Tusuk sate secukupnya",
      "Merica bubuk",
      "3 cm jahe geprek halus",
      "Sambal Kacang tomat cabe"
    ],
    "healthySteps": [
      "1). Cuci bersih ayam lalu potong dadu atau kotak sesuai selera beri air jeruk nipis dan bawang putih geprek, merica bubuk, jahe.",
      "2). Aduk rata lalu diamkan 30-45 menit.",
      "3). Siapkan tusuk sate, tusuk ayam kemudian siapkan teflon atau happy call beri sedikit minyak panggang sampai kecoklatan dan matang.",
      "4). Sajikan dengan sambal kacang tomat cabe dan air jeruk nipis dan sayuran."
    ],
    "description": "Sate Ayam adalah makanan khas Indonesia. Sate Ayam dibuat dari daging ayam. Pada umumnya sate ayam dimasak dengan cara dipanggang dengan menggunakan arang dan disajikan dengan pilihan bumbu kacang atau bumbu kecap. Sate ini biasanya disajikan bersama dengan lontong atau nasi sate ayam adalah makanan makanan kaha madura Jawa Timur.",
    "ingredients": [
      "300 g daging ayam",
      "1 buah air jeruk nipis",
      "1/4 sdt garam",
      "100 g kacang tanah goreng",
      "2 siung bawang putih",
      "2 butir bawang merah",
      "3 butir kemiri",
      "1 sdm gula merah",
      "1 sdm kecap manis",
      "1/2 sdt merica",
      "1/4 sdt garam",
      "150 ml air (secukupnya)",
      "Minyak untuk menumis"
    ],
    "id": 9,
    "steps": [
      "1). Cuci bersih daging ayam, potong-potong kecil seukuran gigitan, lumuri dengan jeruk nipis, daimkan selama 15 menit, lalu bilas bersih.",
      "2). Ambil tusuk sate lalu tusuk-tusuk secukupnya daging ayam. Lakukan hingga habis.",
      "3). Ulek halus semua bumbu kacang, boleh diblender jika dirasa lebih praktis. Tumis hingga matang.",
      "4). Ambil sepertiga bumbu, lumuri semua ayam yang sudah ditusuk, diamkan selama 15 menit agar bumbunya meresap.",
      "5). Siapkan panggangan lalu panggang sate hingga matang sambil sesekali dikipas dan dibolak-balik agar matangnya merata. Lalu angkat."
    ],
    "isFavorite": false,
    "search_record": 0,
    "title": "Sate Ayam",
    "slug": "sate ayam",
    "healthyCalories": 250,
    "calories": 320
  }
]
